MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX254F128B.atdf
      <value-group caption="Reference Clock Output Enable bit" name="REFO1CON__OE">
         <value caption="Reference clock is driven out on REFCLKO pin" name="ENABLE" value="0x1" />
         <value caption="Reference clock is not driven out on REFCLKO pin" name="DISABLE" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Stop in Idle Mode bit" name="REFO1CON__SIDL">
         <value caption="Discontinue module operation when device enters Idle mode" name="ENABLE" value="0x1" />
         <value caption="Continue module operation in Idle mode" name="DISABLE" value="0x0" />
      </value-group>
      <value-group caption="Output Enable bit" name="REFO1CON__ON">
         <value caption="Reference Oscillator Module is enabled" name="ENABLE" value="0x1" />
         <value caption="Reference Oscillator Module is disabled" name="DISABLE" value="0x0" />
      </value-group>
      <value-group caption="Reference Clock Divider bits" name="REFO1CON__RODIV">
         <value caption="REFO clock is Base clock frequency divided by 65534" name="DIV_65534" value="0x7FFF" />
         <value caption="REFO clock is Base clock frequency divided by 6" name="DIV_6" value="0x3" />
         <value caption="REFO clock is Base clock frequency divided by 4" name="DIV_4" value="0x2" />
         <value caption="REFO clock is Base clock frequency divided by 2" name="DIV_2" value="0x1" />
         <value caption="No divider selected" name="NO_DIVIDER" value="0x0" />
      </value-group>
      <value-group caption="Reference Oscillator Trim bits" name="REFO1TRIM__ROTRIM">
         <value caption="511/512 divisor added to RODIV value" name="DIV_511_512" value="0x1ff" />
         <value caption="510/512 divisor added to RODIV value" name="DIV_510_512" value="0x1fe" />
         <value caption="509/512 divisor added to RODIV value" name="DIV_509_512" value="0x1fd" />
         <value caption="508/512 divisor added to RODIV value" name="DIV_508_512" value="0x1fc" />
         <value caption="507/512 divisor added to RODIV value" name="DIV_507_512" value="0x1fb" />
         <value caption="506/512 divisor added to RODIV value" name="DIV_506_512" value="0x1fa" />
         <value caption="505/512 divisor added to RODIV value" name="DIV_505_512" value="0x1f9" />
         <value caption="504/512 divisor added to RODIV value" name="DIV_504_512" value="0x1f8" />
         <value caption="503/512 divisor added to RODIV value" name="DIV_503_512" value="0x1f7" />
         <value caption="502/512 divisor added to RODIV value" name="DIV_502_512" value="0x1f6" />
         <value caption="501/512 divisor added to RODIV value" name="DIV_501_512" value="0x1f5" />
         <value caption="500/512 divisor added to RODIV value" name="DIV_500_512" value="0x1f4" />
         <value caption="499/512 divisor added to RODIV value" name="DIV_499_512" value="0x1f3" />
         <value caption="498/512 divisor added to RODIV value" name="DIV_498_512" value="0x1f2" />
         <value caption="497/512 divisor added to RODIV value" name="DIV_497_512" value="0x1f1" />
         <value caption="496/512 divisor added to RODIV value" name="DIV_496_512" value="0x1f0" />
         <value caption="495/512 divisor added to RODIV value" name="DIV_495_512" value="0x1ef" />
         <value caption="494/512 divisor added to RODIV value" name="DIV_494_512" value="0x1ee" />
         <value caption="493/512 divisor added to RODIV value" name="DIV_493_512" value="0x1ed" />
         <value caption="492/512 divisor added to RODIV value" name="DIV_492_512" value="0x1ec" />
         <value caption="491/512 divisor added to RODIV value" name="DIV_491_512" value="0x1eb" />
         <value caption="490/512 divisor added to RODIV value" name="DIV_490_512" value="0x1ea" />
         <value caption="489/512 divisor added to RODIV value" name="DIV_489_512" value="0x1e9" />
         <value caption="488/512 divisor added to RODIV value" name="DIV_488_512" value="0x1e8" />
         <value caption="487/512 divisor added to RODIV value" name="DIV_487_512" value="0x1e7" />
         <value caption="486/512 divisor added to RODIV value" name="DIV_486_512" value="0x1e6" />
         <value caption="485/512 divisor added to RODIV value" name="DIV_485_512" value="0x1e5" />
         <value caption="484/512 divisor added to RODIV value" name="DIV_484_512" value="0x1e4" />
         <value caption="483/512 divisor added to RODIV value" name="DIV_483_512" value="0x1e3" />
         <value caption="482/512 divisor added to RODIV value" name="DIV_482_512" value="0x1e2" />
         <value caption="481/512 divisor added to RODIV value" name="DIV_481_512" value="0x1e1" />
         <value caption="480/512 divisor added to RODIV value" name="DIV_480_512" value="0x1e0" />
         <value caption="479/512 divisor added to RODIV value" name="DIV_479_512" value="0x1df" />
         <value caption="478/512 divisor added to RODIV value" name="DIV_478_512" value="0x1de" />
         <value caption="477/512 divisor added to RODIV value" name="DIV_477_512" value="0x1dd" />
         <value caption="476/512 divisor added to RODIV value" name="DIV_476_512" value="0x1dc" />
         <value caption="475/512 divisor added to RODIV value" name="DIV_475_512" value="0x1db" />
         <value caption="474/512 divisor added to RODIV value" name="DIV_474_512" value="0x1da" />
         <value caption="473/512 divisor added to RODIV value" name="DIV_473_512" value="0x1d9" />
         <value caption="472/512 divisor added to RODIV value" name="DIV_472_512" value="0x1d8" />
         <value caption="471/512 divisor added to RODIV value" name="DIV_471_512" value="0x1d7" />
         <value caption="470/512 divisor added to RODIV value" name="DIV_470_512" value="0x1d6" />
         <value caption="469/512 divisor added to RODIV value" name="DIV_469_512" value="0x1d5" />
         <value caption="468/512 divisor added to RODIV value" name="DIV_468_512" value="0x1d4" />
         <value caption="467/512 divisor added to RODIV value" name="DIV_467_512" value="0x1d3" />
         <value caption="466/512 divisor added to RODIV value" name="DIV_466_512" value="0x1d2" />
         <value caption="465/512 divisor added to RODIV value" name="DIV_465_512" value="0x1d1" />
         <value caption="464/512 divisor added to RODIV value" name="DIV_464_512" value="0x1d0" />
         <value caption="463/512 divisor added to RODIV value" name="DIV_463_512" value="0x1cf" />
         <value caption="462/512 divisor added to RODIV value" name="DIV_462_512" value="0x1ce" />
         <value caption="461/512 divisor added to RODIV value" name="DIV_461_512" value="0x1cd" />
         <value caption="460/512 divisor added to RODIV value" name="DIV_460_512" value="0x1cc" />
         <value caption="459/512 divisor added to RODIV value" name="DIV_459_512" value="0x1cb" />
         <value caption="458/512 divisor added to RODIV value" name="DIV_458_512" value="0x1ca" />
         <value caption="457/512 divisor added to RODIV value" name="DIV_457_512" value="0x1c9" />
         <value caption="456/512 divisor added to RODIV value" name="DIV_456_512" value="0x1c8" />
         <value caption="455/512 divisor added to RODIV value" name="DIV_455_512" value="0x1c7" />
         <value caption="454/512 divisor added to RODIV value" name="DIV_454_512" value="0x1c6" />
         <value caption="453/512 divisor added to RODIV value" name="DIV_453_512" value="0x1c5" />
         <value caption="452/512 divisor added to RODIV value" name="DIV_452_512" value="0x1c4" />
         <value caption="451/512 divisor added to RODIV value" name="DIV_451_512" value="0x1c3" />
         <value caption="450/512 divisor added to RODIV value" name="DIV_450_512" value="0x1c2" />
         <value caption="449/512 divisor added to RODIV value" name="DIV_449_512" value="0x1c1" />
         <value caption="448/512 divisor added to RODIV value" name="DIV_448_512" value="0x1c0" />
         <value caption="447/512 divisor added to RODIV value" name="DIV_447_512" value="0x1bf" />
         <value caption="446/512 divisor added to RODIV value" name="DIV_446_512" value="0x1be" />
         <value caption="445/512 divisor added to RODIV value" name="DIV_445_512" value="0x1bd" />
         <value caption="444/512 divisor added to RODIV value" name="DIV_444_512" value="0x1bc" />
         <value caption="443/512 divisor added to RODIV value" name="DIV_443_512" value="0x1bb" />
         <value caption="442/512 divisor added to RODIV value" name="DIV_442_512" value="0x1ba" />
         <value caption="441/512 divisor added to RODIV value" name="DIV_441_512" value="0x1b9" />
         <value caption="440/512 divisor added to RODIV value" name="DIV_440_512" value="0x1b8" />
         <value caption="439/512 divisor added to RODIV value" name="DIV_439_512" value="0x1b7" />
         <value caption="438/512 divisor added to RODIV value" name="DIV_438_512" value="0x1b6" />
         <value caption="437/512 divisor added to RODIV value" name="DIV_437_512" value="0x1b5" />
         <value caption="436/512 divisor added to RODIV value" name="DIV_436_512" value="0x1b4" />
         <value caption="435/512 divisor added to RODIV value" name="DIV_435_512" value="0x1b3" />
         <value caption="434/512 divisor added to RODIV value" name="DIV_434_512" value="0x1b2" />
         <value caption="433/512 divisor added to RODIV value" name="DIV_433_512" value="0x1b1" />
         <value caption="432/512 divisor added to RODIV value" name="DIV_432_512" value="0x1b0" />
         <value caption="431/512 divisor added to RODIV value" name="DIV_431_512" value="0x1af" />
         <value caption="430/512 divisor added to RODIV value" name="DIV_430_512" value="0x1ae" />
         <value caption="429/512 divisor added to RODIV value" name="DIV_429_512" value="0x1ad" />
         <value caption="428/512 divisor added to RODIV value" name="DIV_428_512" value="0x1ac" />
         <value caption="427/512 divisor added to RODIV value" name="DIV_427_512" value="0x1ab" />
         <value caption="426/512 divisor added to RODIV value" name="DIV_426_512" value="0x1aa" />
         <value caption="425/512 divisor added to RODIV value" name="DIV_425_512" value="0x1a9" />
         <value caption="424/512 divisor added to RODIV value" name="DIV_424_512" value="0x1a8" />
         <value caption="423/512 divisor added to RODIV value" name="DIV_423_512" value="0x1a7" />
         <value caption="422/512 divisor added to RODIV value" name="DIV_422_512" value="0x1a6" />
         <value caption="421/512 divisor added to RODIV value" name="DIV_421_512" value="0x1a5" />
         <value caption="420/512 divisor added to RODIV value" name="DIV_420_512" value="0x1a4" />
         <value caption="419/512 divisor added to RODIV value" name="DIV_419_512" value="0x1a3" />
         <value caption="418/512 divisor added to RODIV value" name="DIV_418_512" value="0x1a2" />
         <value caption="417/512 divisor added to RODIV value" name="DIV_417_512" value="0x1a1" />
         <value caption="416/512 divisor added to RODIV value" name="DIV_416_512" value="0x1a0" />
         <value caption="415/512 divisor added to RODIV value" name="DIV_415_512" value="0x19f" />
         <value caption="414/512 divisor added to RODIV value" name="DIV_414_512" value="0x19e" />
         <value caption="413/512 divisor added to RODIV value" name="DIV_413_512" value="0x19d" />
         <value caption="412/512 divisor added to RODIV value" name="DIV_412_512" value="0x19c" />
         <value caption="411/512 divisor added to RODIV value" name="DIV_411_512" value="0x19b" />
         <value caption="410/512 divisor added to RODIV value" name="DIV_410_512" value="0x19a" />
         <value caption="409/512 divisor added to RODIV value" name="DIV_409_512" value="0x199" />
         <value caption="408/512 divisor added to RODIV value" name="DIV_408_512" value="0x198" />
         <value caption="407/512 divisor added to RODIV value" name="DIV_407_512" value="0x197" />
         <value caption="406/512 divisor added to RODIV value" name="DIV_406_512" value="0x196" />
         <value caption="405/512 divisor added to RODIV value" name="DIV_405_512" value="0x195" />
         <value caption="404/512 divisor added to RODIV value" name="DIV_404_512" value="0x194" />
         <value caption="403/512 divisor added to RODIV value" name="DIV_403_512" value="0x193" />
         <value caption="402/512 divisor added to RODIV value" name="DIV_402_512" value="0x192" />
         <value caption="401/512 divisor added to RODIV value" name="DIV_401_512" value="0x191" />
         <value caption="400/512 divisor added to RODIV value" name="DIV_400_512" value="0x190" />
         <value caption="399/512 divisor added to RODIV value" name="DIV_399_512" value="0x18f" />
         <value caption="398/512 divisor added to RODIV value" name="DIV_398_512" value="0x18e" />
         <value caption="397/512 divisor added to RODIV value" name="DIV_397_512" value="0x18d" />
         <value caption="396/512 divisor added to RODIV value" name="DIV_396_512" value="0x18c" />
         <value caption="395/512 divisor added to RODIV value" name="DIV_395_512" value="0x18b" />
         <value caption="394/512 divisor added to RODIV value" name="DIV_394_512" value="0x18a" />
         <value caption="393/512 divisor added to RODIV value" name="DIV_393_512" value="0x189" />
         <value caption="392/512 divisor added to RODIV value" name="DIV_392_512" value="0x188" />
         <value caption="391/512 divisor added to RODIV value" name="DIV_391_512" value="0x187" />
         <value caption="390/512 divisor added to RODIV value" name="DIV_390_512" value="0x186" />
         <value caption="389/512 divisor added to RODIV value" name="DIV_389_512" value="0x185" />
         <value caption="388/512 divisor added to RODIV value" name="DIV_388_512" value="0x184" />
         <value caption="387/512 divisor added to RODIV value" name="DIV_387_512" value="0x183" />
         <value caption="386/512 divisor added to RODIV value" name="DIV_386_512" value="0x182" />
         <value caption="385/512 divisor added to RODIV value" name="DIV_385_512" value="0x181" />
         <value caption="384/512 divisor added to RODIV value" name="DIV_384_512" value="0x180" />
         <value caption="383/512 divisor added to RODIV value" name="DIV_383_512" value="0x17f" />
         <value caption="382/512 divisor added to RODIV value" name="DIV_382_512" value="0x17e" />
         <value caption="381/512 divisor added to RODIV value" name="DIV_381_512" value="0x17d" />
         <value caption="380/512 divisor added to RODIV value" name="DIV_380_512" value="0x17c" />
         <value caption="379/512 divisor added to RODIV value" name="DIV_379_512" value="0x17b" />
         <value caption="378/512 divisor added to RODIV value" name="DIV_378_512" value="0x17a" />
         <value caption="377/512 divisor added to RODIV value" name="DIV_377_512" value="0x179" />
         <value caption="376/512 divisor added to RODIV value" name="DIV_376_512" value="0x178" />
         <value caption="375/512 divisor added to RODIV value" name="DIV_375_512" value="0x177" />
         <value caption="374/512 divisor added to RODIV value" name="DIV_374_512" value="0x176" />
         <value caption="373/512 divisor added to RODIV value" name="DIV_373_512" value="0x175" />
         <value caption="372/512 divisor added to RODIV value" name="DIV_372_512" value="0x174" />
         <value caption="371/512 divisor added to RODIV value" name="DIV_371_512" value="0x173" />
         <value caption="370/512 divisor added to RODIV value" name="DIV_370_512" value="0x172" />
         <value caption="369/512 divisor added to RODIV value" name="DIV_369_512" value="0x171" />
         <value caption="368/512 divisor added to RODIV value" name="DIV_368_512" value="0x170" />
         <value caption="367/512 divisor added to RODIV value" name="DIV_367_512" value="0x16f" />
         <value caption="366/512 divisor added to RODIV value" name="DIV_366_512" value="0x16e" />
         <value caption="365/512 divisor added to RODIV value" name="DIV_365_512" value="0x16d" />
         <value caption="364/512 divisor added to RODIV value" name="DIV_364_512" value="0x16c" />
         <value caption="363/512 divisor added to RODIV value" name="DIV_363_512" value="0x16b" />
         <value caption="362/512 divisor added to RODIV value" name="DIV_362_512" value="0x16a" />
         <value caption="361/512 divisor added to RODIV value" name="DIV_361_512" value="0x169" />
         <value caption="360/512 divisor added to RODIV value" name="DIV_360_512" value="0x168" />
         <value caption="359/512 divisor added to RODIV value" name="DIV_359_512" value="0x167" />
         <value caption="358/512 divisor added to RODIV value" name="DIV_358_512" value="0x166" />
         <value caption="357/512 divisor added to RODIV value" name="DIV_357_512" value="0x165" />
         <value caption="356/512 divisor added to RODIV value" name="DIV_356_512" value="0x164" />
         <value caption="355/512 divisor added to RODIV value" name="DIV_355_512" value="0x163" />
         <value caption="354/512 divisor added to RODIV value" name="DIV_354_512" value="0x162" />
         <value caption="353/512 divisor added to RODIV value" name="DIV_353_512" value="0x161" />
         <value caption="352/512 divisor added to RODIV value" name="DIV_352_512" value="0x160" />
         <value caption="351/512 divisor added to RODIV value" name="DIV_351_512" value="0x15f" />
         <value caption="350/512 divisor added to RODIV value" name="DIV_350_512" value="0x15e" />
         <value caption="349/512 divisor added to RODIV value" name="DIV_349_512" value="0x15d" />
         <value caption="348/512 divisor added to RODIV value" name="DIV_348_512" value="0x15c" />
         <value caption="347/512 divisor added to RODIV value" name="DIV_347_512" value="0x15b" />
         <value caption="346/512 divisor added to RODIV value" name="DIV_346_512" value="0x15a" />
         <value caption="345/512 divisor added to RODIV value" name="DIV_345_512" value="0x159" />
         <value caption="344/512 divisor added to RODIV value" name="DIV_344_512" value="0x158" />
         <value caption="343/512 divisor added to RODIV value" name="DIV_343_512" value="0x157" />
         <value caption="342/512 divisor added to RODIV value" name="DIV_342_512" value="0x156" />
         <value caption="341/512 divisor added to RODIV value" name="DIV_341_512" value="0x155" />
         <value caption="340/512 divisor added to RODIV value" name="DIV_340_512" value="0x154" />
         <value caption="339/512 divisor added to RODIV value" name="DIV_339_512" value="0x153" />
         <value caption="338/512 divisor added to RODIV value" name="DIV_338_512" value="0x152" />
         <value caption="337/512 divisor added to RODIV value" name="DIV_337_512" value="0x151" />
         <value caption="336/512 divisor added to RODIV value" name="DIV_336_512" value="0x150" />
         <value caption="335/512 divisor added to RODIV value" name="DIV_335_512" value="0x14f" />
         <value caption="334/512 divisor added to RODIV value" name="DIV_334_512" value="0x14e" />
         <value caption="333/512 divisor added to RODIV value" name="DIV_333_512" value="0x14d" />
         <value caption="332/512 divisor added to RODIV value" name="DIV_332_512" value="0x14c" />
         <value caption="331/512 divisor added to RODIV value" name="DIV_331_512" value="0x14b" />
         <value caption="330/512 divisor added to RODIV value" name="DIV_330_512" value="0x14a" />
         <value caption="329/512 divisor added to RODIV value" name="DIV_329_512" value="0x149" />
         <value caption="328/512 divisor added to RODIV value" name="DIV_328_512" value="0x148" />
         <value caption="327/512 divisor added to RODIV value" name="DIV_327_512" value="0x147" />
         <value caption="326/512 divisor added to RODIV value" name="DIV_326_512" value="0x146" />
         <value caption="325/512 divisor added to RODIV value" name="DIV_325_512" value="0x145" />
         <value caption="324/512 divisor added to RODIV value" name="DIV_324_512" value="0x144" />
         <value caption="323/512 divisor added to RODIV value" name="DIV_323_512" value="0x143" />
         <value caption="322/512 divisor added to RODIV value" name="DIV_322_512" value="0x142" />
         <value caption="321/512 divisor added to RODIV value" name="DIV_321_512" value="0x141" />
         <value caption="320/512 divisor added to RODIV value" name="DIV_320_512" value="0x140" />
         <value caption="319/512 divisor added to RODIV value" name="DIV_319_512" value="0x13f" />
         <value caption="318/512 divisor added to RODIV value" name="DIV_318_512" value="0x13e" />
         <value caption="317/512 divisor added to RODIV value" name="DIV_317_512" value="0x13d" />
         <value caption="316/512 divisor added to RODIV value" name="DIV_316_512" value="0x13c" />
         <value caption="315/512 divisor added to RODIV value" name="DIV_315_512" value="0x13b" />
         <value caption="314/512 divisor added to RODIV value" name="DIV_314_512" value="0x13a" />
         <value caption="313/512 divisor added to RODIV value" name="DIV_313_512" value="0x139" />
         <value caption="312/512 divisor added to RODIV value" name="DIV_312_512" value="0x138" />
         <value caption="311/512 divisor added to RODIV value" name="DIV_311_512" value="0x137" />
         <value caption="310/512 divisor added to RODIV value" name="DIV_310_512" value="0x136" />
         <value caption="309/512 divisor added to RODIV value" name="DIV_309_512" value="0x135" />
         <value caption="308/512 divisor added to RODIV value" name="DIV_308_512" value="0x134" />
         <value caption="307/512 divisor added to RODIV value" name="DIV_307_512" value="0x133" />
         <value caption="306/512 divisor added to RODIV value" name="DIV_306_512" value="0x132" />
         <value caption="305/512 divisor added to RODIV value" name="DIV_305_512" value="0x131" />
         <value caption="304/512 divisor added to RODIV value" name="DIV_304_512" value="0x130" />
         <value caption="303/512 divisor added to RODIV value" name="DIV_303_512" value="0x12f" />
         <value caption="302/512 divisor added to RODIV value" name="DIV_302_512" value="0x12e" />
         <value caption="301/512 divisor added to RODIV value" name="DIV_301_512" value="0x12d" />
         <value caption="300/512 divisor added to RODIV value" name="DIV_300_512" value="0x12c" />
         <value caption="299/512 divisor added to RODIV value" name="DIV_299_512" value="0x12b" />
         <value caption="298/512 divisor added to RODIV value" name="DIV_298_512" value="0x12a" />
         <value caption="297/512 divisor added to RODIV value" name="DIV_297_512" value="0x129" />
         <value caption="296/512 divisor added to RODIV value" name="DIV_296_512" value="0x128" />
         <value caption="295/512 divisor added to RODIV value" name="DIV_295_512" value="0x127" />
         <value caption="294/512 divisor added to RODIV value" name="DIV_294_512" value="0x126" />
         <value caption="293/512 divisor added to RODIV value" name="DIV_293_512" value="0x125" />
         <value caption="292/512 divisor added to RODIV value" name="DIV_292_512" value="0x124" />
         <value caption="291/512 divisor added to RODIV value" name="DIV_291_512" value="0x123" />
         <value caption="290/512 divisor added to RODIV value" name="DIV_290_512" value="0x122" />
         <value caption="289/512 divisor added to RODIV value" name="DIV_289_512" value="0x121" />
         <value caption="288/512 divisor added to RODIV value" name="DIV_288_512" value="0x120" />
         <value caption="287/512 divisor added to RODIV value" name="DIV_287_512" value="0x11f" />
         <value caption="286/512 divisor added to RODIV value" name="DIV_286_512" value="0x11e" />
