MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX254F128B.atdf
         <value caption="285/512 divisor added to RODIV value" name="DIV_285_512" value="0x11d" />
         <value caption="284/512 divisor added to RODIV value" name="DIV_284_512" value="0x11c" />
         <value caption="283/512 divisor added to RODIV value" name="DIV_283_512" value="0x11b" />
         <value caption="282/512 divisor added to RODIV value" name="DIV_282_512" value="0x11a" />
         <value caption="281/512 divisor added to RODIV value" name="DIV_281_512" value="0x119" />
         <value caption="280/512 divisor added to RODIV value" name="DIV_280_512" value="0x118" />
         <value caption="279/512 divisor added to RODIV value" name="DIV_279_512" value="0x117" />
         <value caption="278/512 divisor added to RODIV value" name="DIV_278_512" value="0x116" />
         <value caption="277/512 divisor added to RODIV value" name="DIV_277_512" value="0x115" />
         <value caption="276/512 divisor added to RODIV value" name="DIV_276_512" value="0x114" />
         <value caption="275/512 divisor added to RODIV value" name="DIV_275_512" value="0x113" />
         <value caption="274/512 divisor added to RODIV value" name="DIV_274_512" value="0x112" />
         <value caption="273/512 divisor added to RODIV value" name="DIV_273_512" value="0x111" />
         <value caption="272/512 divisor added to RODIV value" name="DIV_272_512" value="0x110" />
         <value caption="271/512 divisor added to RODIV value" name="DIV_271_512" value="0x10f" />
         <value caption="270/512 divisor added to RODIV value" name="DIV_270_512" value="0x10e" />
         <value caption="269/512 divisor added to RODIV value" name="DIV_269_512" value="0x10d" />
         <value caption="268/512 divisor added to RODIV value" name="DIV_268_512" value="0x10c" />
         <value caption="267/512 divisor added to RODIV value" name="DIV_267_512" value="0x10b" />
         <value caption="266/512 divisor added to RODIV value" name="DIV_266_512" value="0x10a" />
         <value caption="265/512 divisor added to RODIV value" name="DIV_265_512" value="0x109" />
         <value caption="264/512 divisor added to RODIV value" name="DIV_264_512" value="0x108" />
         <value caption="263/512 divisor added to RODIV value" name="DIV_263_512" value="0x107" />
         <value caption="262/512 divisor added to RODIV value" name="DIV_262_512" value="0x106" />
         <value caption="261/512 divisor added to RODIV value" name="DIV_261_512" value="0x105" />
         <value caption="260/512 divisor added to RODIV value" name="DIV_260_512" value="0x104" />
         <value caption="259/512 divisor added to RODIV value" name="DIV_259_512" value="0x103" />
         <value caption="258/512 divisor added to RODIV value" name="DIV_258_512" value="0x102" />
         <value caption="257/512 divisor added to RODIV value" name="DIV_257_512" value="0x101" />
         <value caption="256/512 divisor added to RODIV value" name="DIV_256_512" value="0x100" />
         <value caption="255/512 divisor added to RODIV value" name="DIV_255_512" value="0xff" />
         <value caption="254/512 divisor added to RODIV value" name="DIV_254_512" value="0xfe" />
         <value caption="253/512 divisor added to RODIV value" name="DIV_253_512" value="0xfd" />
         <value caption="252/512 divisor added to RODIV value" name="DIV_252_512" value="0xfc" />
         <value caption="251/512 divisor added to RODIV value" name="DIV_251_512" value="0xfb" />
         <value caption="250/512 divisor added to RODIV value" name="DIV_250_512" value="0xfa" />
         <value caption="249/512 divisor added to RODIV value" name="DIV_249_512" value="0xf9" />
         <value caption="248/512 divisor added to RODIV value" name="DIV_248_512" value="0xf8" />
         <value caption="247/512 divisor added to RODIV value" name="DIV_247_512" value="0xf7" />
         <value caption="246/512 divisor added to RODIV value" name="DIV_246_512" value="0xf6" />
         <value caption="245/512 divisor added to RODIV value" name="DIV_245_512" value="0xf5" />
         <value caption="244/512 divisor added to RODIV value" name="DIV_244_512" value="0xf4" />
         <value caption="243/512 divisor added to RODIV value" name="DIV_243_512" value="0xf3" />
         <value caption="242/512 divisor added to RODIV value" name="DIV_242_512" value="0xf2" />
         <value caption="241/512 divisor added to RODIV value" name="DIV_241_512" value="0xf1" />
         <value caption="240/512 divisor added to RODIV value" name="DIV_240_512" value="0xf0" />
         <value caption="239/512 divisor added to RODIV value" name="DIV_239_512" value="0xef" />
         <value caption="238/512 divisor added to RODIV value" name="DIV_238_512" value="0xee" />
         <value caption="237/512 divisor added to RODIV value" name="DIV_237_512" value="0xed" />
         <value caption="236/512 divisor added to RODIV value" name="DIV_236_512" value="0xec" />
         <value caption="235/512 divisor added to RODIV value" name="DIV_235_512" value="0xeb" />
         <value caption="234/512 divisor added to RODIV value" name="DIV_234_512" value="0xea" />
         <value caption="233/512 divisor added to RODIV value" name="DIV_233_512" value="0xe9" />
         <value caption="232/512 divisor added to RODIV value" name="DIV_232_512" value="0xe8" />
         <value caption="231/512 divisor added to RODIV value" name="DIV_231_512" value="0xe7" />
         <value caption="230/512 divisor added to RODIV value" name="DIV_230_512" value="0xe6" />
         <value caption="229/512 divisor added to RODIV value" name="DIV_229_512" value="0xe5" />
         <value caption="228/512 divisor added to RODIV value" name="DIV_228_512" value="0xe4" />
         <value caption="227/512 divisor added to RODIV value" name="DIV_227_512" value="0xe3" />
         <value caption="226/512 divisor added to RODIV value" name="DIV_226_512" value="0xe2" />
         <value caption="225/512 divisor added to RODIV value" name="DIV_225_512" value="0xe1" />
         <value caption="224/512 divisor added to RODIV value" name="DIV_224_512" value="0xe0" />
         <value caption="223/512 divisor added to RODIV value" name="DIV_223_512" value="0xdf" />
         <value caption="222/512 divisor added to RODIV value" name="DIV_222_512" value="0xde" />
         <value caption="221/512 divisor added to RODIV value" name="DIV_221_512" value="0xdd" />
         <value caption="220/512 divisor added to RODIV value" name="DIV_220_512" value="0xdc" />
         <value caption="219/512 divisor added to RODIV value" name="DIV_219_512" value="0xdb" />
         <value caption="218/512 divisor added to RODIV value" name="DIV_218_512" value="0xda" />
         <value caption="217/512 divisor added to RODIV value" name="DIV_217_512" value="0xd9" />
         <value caption="216/512 divisor added to RODIV value" name="DIV_216_512" value="0xd8" />
         <value caption="215/512 divisor added to RODIV value" name="DIV_215_512" value="0xd7" />
         <value caption="214/512 divisor added to RODIV value" name="DIV_214_512" value="0xd6" />
         <value caption="213/512 divisor added to RODIV value" name="DIV_213_512" value="0xd5" />
         <value caption="212/512 divisor added to RODIV value" name="DIV_212_512" value="0xd4" />
         <value caption="211/512 divisor added to RODIV value" name="DIV_211_512" value="0xd3" />
         <value caption="210/512 divisor added to RODIV value" name="DIV_210_512" value="0xd2" />
         <value caption="209/512 divisor added to RODIV value" name="DIV_209_512" value="0xd1" />
         <value caption="208/512 divisor added to RODIV value" name="DIV_208_512" value="0xd0" />
         <value caption="207/512 divisor added to RODIV value" name="DIV_207_512" value="0xcf" />
         <value caption="206/512 divisor added to RODIV value" name="DIV_206_512" value="0xce" />
         <value caption="205/512 divisor added to RODIV value" name="DIV_205_512" value="0xcd" />
         <value caption="204/512 divisor added to RODIV value" name="DIV_204_512" value="0xcc" />
         <value caption="203/512 divisor added to RODIV value" name="DIV_203_512" value="0xcb" />
         <value caption="202/512 divisor added to RODIV value" name="DIV_202_512" value="0xca" />
         <value caption="201/512 divisor added to RODIV value" name="DIV_201_512" value="0xc9" />
         <value caption="200/512 divisor added to RODIV value" name="DIV_200_512" value="0xc8" />
         <value caption="199/512 divisor added to RODIV value" name="DIV_199_512" value="0xc7" />
         <value caption="198/512 divisor added to RODIV value" name="DIV_198_512" value="0xc6" />
         <value caption="197/512 divisor added to RODIV value" name="DIV_197_512" value="0xc5" />
         <value caption="196/512 divisor added to RODIV value" name="DIV_196_512" value="0xc4" />
         <value caption="195/512 divisor added to RODIV value" name="DIV_195_512" value="0xc3" />
         <value caption="194/512 divisor added to RODIV value" name="DIV_194_512" value="0xc2" />
         <value caption="193/512 divisor added to RODIV value" name="DIV_193_512" value="0xc1" />
         <value caption="192/512 divisor added to RODIV value" name="DIV_192_512" value="0xc0" />
         <value caption="191/512 divisor added to RODIV value" name="DIV_191_512" value="0xbf" />
         <value caption="190/512 divisor added to RODIV value" name="DIV_190_512" value="0xbe" />
         <value caption="189/512 divisor added to RODIV value" name="DIV_189_512" value="0xbd" />
         <value caption="188/512 divisor added to RODIV value" name="DIV_188_512" value="0xbc" />
         <value caption="187/512 divisor added to RODIV value" name="DIV_187_512" value="0xbb" />
         <value caption="186/512 divisor added to RODIV value" name="DIV_186_512" value="0xba" />
         <value caption="185/512 divisor added to RODIV value" name="DIV_185_512" value="0xb9" />
         <value caption="184/512 divisor added to RODIV value" name="DIV_184_512" value="0xb8" />
         <value caption="183/512 divisor added to RODIV value" name="DIV_183_512" value="0xb7" />
         <value caption="182/512 divisor added to RODIV value" name="DIV_182_512" value="0xb6" />
         <value caption="181/512 divisor added to RODIV value" name="DIV_181_512" value="0xb5" />
         <value caption="180/512 divisor added to RODIV value" name="DIV_180_512" value="0xb4" />
         <value caption="179/512 divisor added to RODIV value" name="DIV_179_512" value="0xb3" />
         <value caption="178/512 divisor added to RODIV value" name="DIV_178_512" value="0xb2" />
         <value caption="177/512 divisor added to RODIV value" name="DIV_177_512" value="0xb1" />
         <value caption="176/512 divisor added to RODIV value" name="DIV_176_512" value="0xb0" />
         <value caption="175/512 divisor added to RODIV value" name="DIV_175_512" value="0xaf" />
         <value caption="174/512 divisor added to RODIV value" name="DIV_174_512" value="0xae" />
         <value caption="173/512 divisor added to RODIV value" name="DIV_173_512" value="0xad" />
         <value caption="172/512 divisor added to RODIV value" name="DIV_172_512" value="0xac" />
         <value caption="171/512 divisor added to RODIV value" name="DIV_171_512" value="0xab" />
         <value caption="170/512 divisor added to RODIV value" name="DIV_170_512" value="0xaa" />
         <value caption="169/512 divisor added to RODIV value" name="DIV_169_512" value="0xa9" />
         <value caption="168/512 divisor added to RODIV value" name="DIV_168_512" value="0xa8" />
         <value caption="167/512 divisor added to RODIV value" name="DIV_167_512" value="0xa7" />
         <value caption="166/512 divisor added to RODIV value" name="DIV_166_512" value="0xa6" />
         <value caption="165/512 divisor added to RODIV value" name="DIV_165_512" value="0xa5" />
         <value caption="164/512 divisor added to RODIV value" name="DIV_164_512" value="0xa4" />
         <value caption="163/512 divisor added to RODIV value" name="DIV_163_512" value="0xa3" />
         <value caption="162/512 divisor added to RODIV value" name="DIV_162_512" value="0xa2" />
         <value caption="161/512 divisor added to RODIV value" name="DIV_161_512" value="0xa1" />
         <value caption="160/512 divisor added to RODIV value" name="DIV_160_512" value="0xa0" />
         <value caption="159/512 divisor added to RODIV value" name="DIV_159_512" value="0x9f" />
         <value caption="158/512 divisor added to RODIV value" name="DIV_158_512" value="0x9e" />
         <value caption="157/512 divisor added to RODIV value" name="DIV_157_512" value="0x9d" />
         <value caption="156/512 divisor added to RODIV value" name="DIV_156_512" value="0x9c" />
         <value caption="155/512 divisor added to RODIV value" name="DIV_155_512" value="0x9b" />
         <value caption="154/512 divisor added to RODIV value" name="DIV_154_512" value="0x9a" />
         <value caption="153/512 divisor added to RODIV value" name="DIV_153_512" value="0x99" />
         <value caption="152/512 divisor added to RODIV value" name="DIV_152_512" value="0x98" />
         <value caption="151/512 divisor added to RODIV value" name="DIV_151_512" value="0x97" />
         <value caption="150/512 divisor added to RODIV value" name="DIV_150_512" value="0x96" />
         <value caption="149/512 divisor added to RODIV value" name="DIV_149_512" value="0x95" />
         <value caption="148/512 divisor added to RODIV value" name="DIV_148_512" value="0x94" />
         <value caption="147/512 divisor added to RODIV value" name="DIV_147_512" value="0x93" />
         <value caption="146/512 divisor added to RODIV value" name="DIV_146_512" value="0x92" />
         <value caption="145/512 divisor added to RODIV value" name="DIV_145_512" value="0x91" />
         <value caption="144/512 divisor added to RODIV value" name="DIV_144_512" value="0x90" />
         <value caption="143/512 divisor added to RODIV value" name="DIV_143_512" value="0x8f" />
         <value caption="142/512 divisor added to RODIV value" name="DIV_142_512" value="0x8e" />
         <value caption="141/512 divisor added to RODIV value" name="DIV_141_512" value="0x8d" />
         <value caption="140/512 divisor added to RODIV value" name="DIV_140_512" value="0x8c" />
         <value caption="139/512 divisor added to RODIV value" name="DIV_139_512" value="0x8b" />
         <value caption="138/512 divisor added to RODIV value" name="DIV_138_512" value="0x8a" />
         <value caption="137/512 divisor added to RODIV value" name="DIV_137_512" value="0x89" />
         <value caption="136/512 divisor added to RODIV value" name="DIV_136_512" value="0x88" />
         <value caption="135/512 divisor added to RODIV value" name="DIV_135_512" value="0x87" />
         <value caption="134/512 divisor added to RODIV value" name="DIV_134_512" value="0x86" />
         <value caption="133/512 divisor added to RODIV value" name="DIV_133_512" value="0x85" />
         <value caption="132/512 divisor added to RODIV value" name="DIV_132_512" value="0x84" />
         <value caption="131/512 divisor added to RODIV value" name="DIV_131_512" value="0x83" />
         <value caption="130/512 divisor added to RODIV value" name="DIV_130_512" value="0x82" />
         <value caption="129/512 divisor added to RODIV value" name="DIV_129_512" value="0x81" />
         <value caption="128/512 divisor added to RODIV value" name="DIV_128_512" value="0x80" />
         <value caption="127/512 divisor added to RODIV value" name="DIV_127_512" value="0x7f" />
         <value caption="126/512 divisor added to RODIV value" name="DIV_126_512" value="0x7e" />
         <value caption="125/512 divisor added to RODIV value" name="DIV_125_512" value="0x7d" />
         <value caption="124/512 divisor added to RODIV value" name="DIV_124_512" value="0x7c" />
         <value caption="123/512 divisor added to RODIV value" name="DIV_123_512" value="0x7b" />
         <value caption="122/512 divisor added to RODIV value" name="DIV_122_512" value="0x7a" />
         <value caption="121/512 divisor added to RODIV value" name="DIV_121_512" value="0x79" />
         <value caption="120/512 divisor added to RODIV value" name="DIV_120_512" value="0x78" />
         <value caption="119/512 divisor added to RODIV value" name="DIV_119_512" value="0x77" />
         <value caption="118/512 divisor added to RODIV value" name="DIV_118_512" value="0x76" />
         <value caption="117/512 divisor added to RODIV value" name="DIV_117_512" value="0x75" />
         <value caption="116/512 divisor added to RODIV value" name="DIV_116_512" value="0x74" />
         <value caption="115/512 divisor added to RODIV value" name="DIV_115_512" value="0x73" />
         <value caption="114/512 divisor added to RODIV value" name="DIV_114_512" value="0x72" />
         <value caption="113/512 divisor added to RODIV value" name="DIV_113_512" value="0x71" />
         <value caption="112/512 divisor added to RODIV value" name="DIV_112_512" value="0x70" />
         <value caption="111/512 divisor added to RODIV value" name="DIV_111_512" value="0x6f" />
         <value caption="110/512 divisor added to RODIV value" name="DIV_110_512" value="0x6e" />
         <value caption="109/512 divisor added to RODIV value" name="DIV_109_512" value="0x6d" />
         <value caption="108/512 divisor added to RODIV value" name="DIV_108_512" value="0x6c" />
         <value caption="107/512 divisor added to RODIV value" name="DIV_107_512" value="0x6b" />
         <value caption="106/512 divisor added to RODIV value" name="DIV_106_512" value="0x6a" />
         <value caption="105/512 divisor added to RODIV value" name="DIV_105_512" value="0x69" />
         <value caption="104/512 divisor added to RODIV value" name="DIV_104_512" value="0x68" />
         <value caption="103/512 divisor added to RODIV value" name="DIV_103_512" value="0x67" />
         <value caption="102/512 divisor added to RODIV value" name="DIV_102_512" value="0x66" />
         <value caption="101/512 divisor added to RODIV value" name="DIV_101_512" value="0x65" />
         <value caption="100/512 divisor added to RODIV value" name="DIV_100_512" value="0x64" />
         <value caption="99/512 divisor added to RODIV value" name="DIV_99_512" value="0x63" />
         <value caption="98/512 divisor added to RODIV value" name="DIV_98_512" value="0x62" />
         <value caption="97/512 divisor added to RODIV value" name="DIV_97_512" value="0x61" />
         <value caption="96/512 divisor added to RODIV value" name="DIV_96_512" value="0x60" />
         <value caption="95/512 divisor added to RODIV value" name="DIV_95_512" value="0x5f" />
         <value caption="94/512 divisor added to RODIV value" name="DIV_94_512" value="0x5e" />
         <value caption="93/512 divisor added to RODIV value" name="DIV_93_512" value="0x5d" />
         <value caption="92/512 divisor added to RODIV value" name="DIV_92_512" value="0x5c" />
         <value caption="91/512 divisor added to RODIV value" name="DIV_91_512" value="0x5b" />
         <value caption="90/512 divisor added to RODIV value" name="DIV_90_512" value="0x5a" />
         <value caption="89/512 divisor added to RODIV value" name="DIV_89_512" value="0x59" />
         <value caption="88/512 divisor added to RODIV value" name="DIV_88_512" value="0x58" />
         <value caption="87/512 divisor added to RODIV value" name="DIV_87_512" value="0x57" />
         <value caption="86/512 divisor added to RODIV value" name="DIV_86_512" value="0x56" />
         <value caption="85/512 divisor added to RODIV value" name="DIV_85_512" value="0x55" />
         <value caption="84/512 divisor added to RODIV value" name="DIV_84_512" value="0x54" />
         <value caption="83/512 divisor added to RODIV value" name="DIV_83_512" value="0x53" />
         <value caption="82/512 divisor added to RODIV value" name="DIV_82_512" value="0x52" />
         <value caption="81/512 divisor added to RODIV value" name="DIV_81_512" value="0x51" />
         <value caption="80/512 divisor added to RODIV value" name="DIV_80_512" value="0x50" />
         <value caption="79/512 divisor added to RODIV value" name="DIV_79_512" value="0x4f" />
         <value caption="78/512 divisor added to RODIV value" name="DIV_78_512" value="0x4e" />
         <value caption="77/512 divisor added to RODIV value" name="DIV_77_512" value="0x4d" />
         <value caption="76/512 divisor added to RODIV value" name="DIV_76_512" value="0x4c" />
         <value caption="75/512 divisor added to RODIV value" name="DIV_75_512" value="0x4b" />
         <value caption="74/512 divisor added to RODIV value" name="DIV_74_512" value="0x4a" />
         <value caption="73/512 divisor added to RODIV value" name="DIV_73_512" value="0x49" />
         <value caption="72/512 divisor added to RODIV value" name="DIV_72_512" value="0x48" />
         <value caption="71/512 divisor added to RODIV value" name="DIV_71_512" value="0x47" />
         <value caption="70/512 divisor added to RODIV value" name="DIV_70_512" value="0x46" />
         <value caption="69/512 divisor added to RODIV value" name="DIV_69_512" value="0x45" />
         <value caption="68/512 divisor added to RODIV value" name="DIV_68_512" value="0x44" />
         <value caption="67/512 divisor added to RODIV value" name="DIV_67_512" value="0x43" />
         <value caption="66/512 divisor added to RODIV value" name="DIV_66_512" value="0x42" />
         <value caption="65/512 divisor added to RODIV value" name="DIV_65_512" value="0x41" />
         <value caption="64/512 divisor added to RODIV value" name="DIV_64_512" value="0x40" />
         <value caption="63/512 divisor added to RODIV value" name="DIV_63_512" value="0x3f" />
         <value caption="62/512 divisor added to RODIV value" name="DIV_62_512" value="0x3e" />
         <value caption="61/512 divisor added to RODIV value" name="DIV_61_512" value="0x3d" />
         <value caption="60/512 divisor added to RODIV value" name="DIV_60_512" value="0x3c" />
         <value caption="59/512 divisor added to RODIV value" name="DIV_59_512" value="0x3b" />
         <value caption="58/512 divisor added to RODIV value" name="DIV_58_512" value="0x3a" />
         <value caption="57/512 divisor added to RODIV value" name="DIV_57_512" value="0x39" />
         <value caption="56/512 divisor added to RODIV value" name="DIV_56_512" value="0x38" />
         <value caption="55/512 divisor added to RODIV value" name="DIV_55_512" value="0x37" />
         <value caption="54/512 divisor added to RODIV value" name="DIV_54_512" value="0x36" />
         <value caption="53/512 divisor added to RODIV value" name="DIV_53_512" value="0x35" />
         <value caption="52/512 divisor added to RODIV value" name="DIV_52_512" value="0x34" />
         <value caption="51/512 divisor added to RODIV value" name="DIV_51_512" value="0x33" />
         <value caption="50/512 divisor added to RODIV value" name="DIV_50_512" value="0x32" />
         <value caption="49/512 divisor added to RODIV value" name="DIV_49_512" value="0x31" />
         <value caption="48/512 divisor added to RODIV value" name="DIV_48_512" value="0x30" />
         <value caption="47/512 divisor added to RODIV value" name="DIV_47_512" value="0x2f" />
         <value caption="46/512 divisor added to RODIV value" name="DIV_46_512" value="0x2e" />
         <value caption="45/512 divisor added to RODIV value" name="DIV_45_512" value="0x2d" />
         <value caption="44/512 divisor added to RODIV value" name="DIV_44_512" value="0x2c" />
         <value caption="43/512 divisor added to RODIV value" name="DIV_43_512" value="0x2b" />
         <value caption="42/512 divisor added to RODIV value" name="DIV_42_512" value="0x2a" />
         <value caption="41/512 divisor added to RODIV value" name="DIV_41_512" value="0x29" />
