MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX254F128B.atdf
         <value caption="40/512 divisor added to RODIV value" name="DIV_40_512" value="0x28" />
         <value caption="39/512 divisor added to RODIV value" name="DIV_39_512" value="0x27" />
         <value caption="38/512 divisor added to RODIV value" name="DIV_38_512" value="0x26" />
         <value caption="37/512 divisor added to RODIV value" name="DIV_37_512" value="0x25" />
         <value caption="36/512 divisor added to RODIV value" name="DIV_36_512" value="0x24" />
         <value caption="35/512 divisor added to RODIV value" name="DIV_35_512" value="0x23" />
         <value caption="34/512 divisor added to RODIV value" name="DIV_34_512" value="0x22" />
         <value caption="33/512 divisor added to RODIV value" name="DIV_33_512" value="0x21" />
         <value caption="32/512 divisor added to RODIV value" name="DIV_32_512" value="0x20" />
         <value caption="31/512 divisor added to RODIV value" name="DIV_31_512" value="0x1f" />
         <value caption="30/512 divisor added to RODIV value" name="DIV_30_512" value="0x1e" />
         <value caption="29/512 divisor added to RODIV value" name="DIV_29_512" value="0x1d" />
         <value caption="28/512 divisor added to RODIV value" name="DIV_28_512" value="0x1c" />
         <value caption="27/512 divisor added to RODIV value" name="DIV_27_512" value="0x1b" />
         <value caption="26/512 divisor added to RODIV value" name="DIV_26_512" value="0x1a" />
         <value caption="25/512 divisor added to RODIV value" name="DIV_25_512" value="0x19" />
         <value caption="24/512 divisor added to RODIV value" name="DIV_24_512" value="0x18" />
         <value caption="23/512 divisor added to RODIV value" name="DIV_23_512" value="0x17" />
         <value caption="22/512 divisor added to RODIV value" name="DIV_22_512" value="0x16" />
         <value caption="21/512 divisor added to RODIV value" name="DIV_21_512" value="0x15" />
         <value caption="20/512 divisor added to RODIV value" name="DIV_20_512" value="0x14" />
         <value caption="19/512 divisor added to RODIV value" name="DIV_19_512" value="0x13" />
         <value caption="18/512 divisor added to RODIV value" name="DIV_18_512" value="0x12" />
         <value caption="17/512 divisor added to RODIV value" name="DIV_17_512" value="0x11" />
         <value caption="16/512 divisor added to RODIV value" name="DIV_16_512" value="0x10" />
         <value caption="15/512 divisor added to RODIV value" name="DIV_15_512" value="0xf" />
         <value caption="14/512 divisor added to RODIV value" name="DIV_14_512" value="0xe" />
         <value caption="13/512 divisor added to RODIV value" name="DIV_13_512" value="0xd" />
         <value caption="12/512 divisor added to RODIV value" name="DIV_12_512" value="0xc" />
         <value caption="11/512 divisor added to RODIV value" name="DIV_11_512" value="0xb" />
         <value caption="10/512 divisor added to RODIV value" name="DIV_10_512" value="0xa" />
         <value caption="9/512 divisor added to RODIV value" name="DIV_9_512" value="0x9" />
         <value caption="8/512 divisor added to RODIV value" name="DIV_8_512" value="0x8" />
         <value caption="7/512 divisor added to RODIV value" name="DIV_7_512" value="0x7" />
         <value caption="6/512 divisor added to RODIV value" name="DIV_6_512" value="0x6" />
         <value caption="5/512 divisor added to RODIV value" name="DIV_5_512" value="0x5" />
         <value caption="4/512 divisor added to RODIV value" name="DIV_4_512" value="0x4" />
         <value caption="3/512 divisor added to RODIV value" name="DIV_3_512" value="0x3" />
         <value caption="2/512 divisor added to RODIV value" name="DIV_2_512" value="0x2" />
         <value caption="1/512 divisor added to RODIV value" name="DIV_1_512" value="0x1" />
         <value caption="0 divisor added to RODIV value" name="DIV_0" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus Clock Divisor Control bits" name="PB1DIV__PBDIV">
         <value caption="PBCLK is SYSCLK divided by 128" name="DIV_128" value="0x7f" />
         <value caption="PBCLK is SYSCLK divided by 127" name="DIV_127" value="0x7e" />
         <value caption="PBCLK is SYSCLK divided by 126" name="DIV_126" value="0x7d" />
         <value caption="PBCLK is SYSCLK divided by 125" name="DIV_125" value="0x7c" />
         <value caption="PBCLK is SYSCLK divided by 124" name="DIV_124" value="0x7b" />
         <value caption="PBCLK is SYSCLK divided by 123" name="DIV_123" value="0x7a" />
         <value caption="PBCLK is SYSCLK divided by 122" name="DIV_122" value="0x79" />
         <value caption="PBCLK is SYSCLK divided by 121" name="DIV_121" value="0x78" />
         <value caption="PBCLK is SYSCLK divided by 120" name="DIV_120" value="0x77" />
         <value caption="PBCLK is SYSCLK divided by 119" name="DIV_119" value="0x76" />
         <value caption="PBCLK is SYSCLK divided by 118" name="DIV_118" value="0x75" />
         <value caption="PBCLK is SYSCLK divided by 117" name="DIV_117" value="0x74" />
         <value caption="PBCLK is SYSCLK divided by 116" name="DIV_116" value="0x73" />
         <value caption="PBCLK is SYSCLK divided by 115" name="DIV_115" value="0x72" />
         <value caption="PBCLK is SYSCLK divided by 114" name="DIV_114" value="0x71" />
         <value caption="PBCLK is SYSCLK divided by 113" name="DIV_113" value="0x70" />
         <value caption="PBCLK is SYSCLK divided by 112" name="DIV_112" value="0x6f" />
         <value caption="PBCLK is SYSCLK divided by 111" name="DIV_111" value="0x6e" />
         <value caption="PBCLK is SYSCLK divided by 110" name="DIV_110" value="0x6d" />
         <value caption="PBCLK is SYSCLK divided by 109" name="DIV_109" value="0x6c" />
         <value caption="PBCLK is SYSCLK divided by 108" name="DIV_108" value="0x6b" />
         <value caption="PBCLK is SYSCLK divided by 107" name="DIV_107" value="0x6a" />
         <value caption="PBCLK is SYSCLK divided by 106" name="DIV_106" value="0x69" />
         <value caption="PBCLK is SYSCLK divided by 105" name="DIV_105" value="0x68" />
         <value caption="PBCLK is SYSCLK divided by 104" name="DIV_104" value="0x67" />
         <value caption="PBCLK is SYSCLK divided by 103" name="DIV_103" value="0x66" />
         <value caption="PBCLK is SYSCLK divided by 102" name="DIV_102" value="0x65" />
         <value caption="PBCLK is SYSCLK divided by 101" name="DIV_101" value="0x64" />
         <value caption="PBCLK is SYSCLK divided by 100" name="DIV_100" value="0x63" />
         <value caption="PBCLK is SYSCLK divided by 99" name="DIV_99" value="0x62" />
         <value caption="PBCLK is SYSCLK divided by 98" name="DIV_98" value="0x61" />
         <value caption="PBCLK is SYSCLK divided by 97" name="DIV_97" value="0x60" />
         <value caption="PBCLK is SYSCLK divided by 96" name="DIV_96" value="0x5f" />
         <value caption="PBCLK is SYSCLK divided by 95" name="DIV_95" value="0x5e" />
         <value caption="PBCLK is SYSCLK divided by 94" name="DIV_94" value="0x5d" />
         <value caption="PBCLK is SYSCLK divided by 93" name="DIV_93" value="0x5c" />
         <value caption="PBCLK is SYSCLK divided by 92" name="DIV_92" value="0x5b" />
         <value caption="PBCLK is SYSCLK divided by 91" name="DIV_91" value="0x5a" />
         <value caption="PBCLK is SYSCLK divided by 90" name="DIV_90" value="0x59" />
         <value caption="PBCLK is SYSCLK divided by 89" name="DIV_89" value="0x58" />
         <value caption="PBCLK is SYSCLK divided by 88" name="DIV_88" value="0x57" />
         <value caption="PBCLK is SYSCLK divided by 87" name="DIV_87" value="0x56" />
         <value caption="PBCLK is SYSCLK divided by 86" name="DIV_86" value="0x55" />
         <value caption="PBCLK is SYSCLK divided by 85" name="DIV_85" value="0x54" />
         <value caption="PBCLK is SYSCLK divided by 84" name="DIV_84" value="0x53" />
         <value caption="PBCLK is SYSCLK divided by 83" name="DIV_83" value="0x52" />
         <value caption="PBCLK is SYSCLK divided by 82" name="DIV_82" value="0x51" />
         <value caption="PBCLK is SYSCLK divided by 81" name="DIV_81" value="0x50" />
         <value caption="PBCLK is SYSCLK divided by 80" name="DIV_80" value="0x4f" />
         <value caption="PBCLK is SYSCLK divided by 79" name="DIV_79" value="0x4e" />
         <value caption="PBCLK is SYSCLK divided by 78" name="DIV_78" value="0x4d" />
         <value caption="PBCLK is SYSCLK divided by 77" name="DIV_77" value="0x4c" />
         <value caption="PBCLK is SYSCLK divided by 76" name="DIV_76" value="0x4b" />
         <value caption="PBCLK is SYSCLK divided by 75" name="DIV_75" value="0x4a" />
         <value caption="PBCLK is SYSCLK divided by 74" name="DIV_74" value="0x49" />
         <value caption="PBCLK is SYSCLK divided by 73" name="DIV_73" value="0x48" />
         <value caption="PBCLK is SYSCLK divided by 72" name="DIV_72" value="0x47" />
         <value caption="PBCLK is SYSCLK divided by 71" name="DIV_71" value="0x46" />
         <value caption="PBCLK is SYSCLK divided by 70" name="DIV_70" value="0x45" />
         <value caption="PBCLK is SYSCLK divided by 69" name="DIV_69" value="0x44" />
         <value caption="PBCLK is SYSCLK divided by 68" name="DIV_68" value="0x43" />
         <value caption="PBCLK is SYSCLK divided by 67" name="DIV_67" value="0x42" />
         <value caption="PBCLK is SYSCLK divided by 66" name="DIV_66" value="0x41" />
         <value caption="PBCLK is SYSCLK divided by 65" name="DIV_65" value="0x40" />
         <value caption="PBCLK is SYSCLK divided by 64" name="DIV_64" value="0x3f" />
         <value caption="PBCLK is SYSCLK divided by 63" name="DIV_63" value="0x3e" />
         <value caption="PBCLK is SYSCLK divided by 62" name="DIV_62" value="0x3d" />
         <value caption="PBCLK is SYSCLK divided by 61" name="DIV_61" value="0x3c" />
         <value caption="PBCLK is SYSCLK divided by 60" name="DIV_60" value="0x3b" />
         <value caption="PBCLK is SYSCLK divided by 59" name="DIV_59" value="0x3a" />
         <value caption="PBCLK is SYSCLK divided by 58" name="DIV_58" value="0x39" />
         <value caption="PBCLK is SYSCLK divided by 57" name="DIV_57" value="0x38" />
         <value caption="PBCLK is SYSCLK divided by 56" name="DIV_56" value="0x37" />
         <value caption="PBCLK is SYSCLK divided by 55" name="DIV_55" value="0x36" />
         <value caption="PBCLK is SYSCLK divided by 54" name="DIV_54" value="0x35" />
         <value caption="PBCLK is SYSCLK divided by 53" name="DIV_53" value="0x34" />
         <value caption="PBCLK is SYSCLK divided by 52" name="DIV_52" value="0x33" />
         <value caption="PBCLK is SYSCLK divided by 51" name="DIV_51" value="0x32" />
         <value caption="PBCLK is SYSCLK divided by 50" name="DIV_50" value="0x31" />
         <value caption="PBCLK is SYSCLK divided by 49" name="DIV_49" value="0x30" />
         <value caption="PBCLK is SYSCLK divided by 48" name="DIV_48" value="0x2f" />
         <value caption="PBCLK is SYSCLK divided by 47" name="DIV_47" value="0x2e" />
         <value caption="PBCLK is SYSCLK divided by 46" name="DIV_46" value="0x2d" />
         <value caption="PBCLK is SYSCLK divided by 45" name="DIV_45" value="0x2c" />
         <value caption="PBCLK is SYSCLK divided by 44" name="DIV_44" value="0x2b" />
         <value caption="PBCLK is SYSCLK divided by 43" name="DIV_43" value="0x2a" />
         <value caption="PBCLK is SYSCLK divided by 42" name="DIV_42" value="0x29" />
         <value caption="PBCLK is SYSCLK divided by 41" name="DIV_41" value="0x28" />
         <value caption="PBCLK is SYSCLK divided by 40" name="DIV_40" value="0x27" />
         <value caption="PBCLK is SYSCLK divided by 39" name="DIV_39" value="0x26" />
         <value caption="PBCLK is SYSCLK divided by 38" name="DIV_38" value="0x25" />
         <value caption="PBCLK is SYSCLK divided by 37" name="DIV_37" value="0x24" />
         <value caption="PBCLK is SYSCLK divided by 36" name="DIV_36" value="0x23" />
         <value caption="PBCLK is SYSCLK divided by 35" name="DIV_35" value="0x22" />
         <value caption="PBCLK is SYSCLK divided by 34" name="DIV_34" value="0x21" />
         <value caption="PBCLK is SYSCLK divided by 33" name="DIV_33" value="0x20" />
         <value caption="PBCLK is SYSCLK divided by 32" name="DIV_32" value="0x1f" />
         <value caption="PBCLK is SYSCLK divided by 31" name="DIV_31" value="0x1e" />
         <value caption="PBCLK is SYSCLK divided by 30" name="DIV_30" value="0x1d" />
         <value caption="PBCLK is SYSCLK divided by 29" name="DIV_29" value="0x1c" />
         <value caption="PBCLK is SYSCLK divided by 28" name="DIV_28" value="0x1b" />
         <value caption="PBCLK is SYSCLK divided by 27" name="DIV_27" value="0x1a" />
         <value caption="PBCLK is SYSCLK divided by 26" name="DIV_26" value="0x19" />
         <value caption="PBCLK is SYSCLK divided by 25" name="DIV_25" value="0x18" />
         <value caption="PBCLK is SYSCLK divided by 24" name="DIV_24" value="0x17" />
         <value caption="PBCLK is SYSCLK divided by 23" name="DIV_23" value="0x16" />
         <value caption="PBCLK is SYSCLK divided by 22" name="DIV_22" value="0x15" />
         <value caption="PBCLK is SYSCLK divided by 21" name="DIV_21" value="0x14" />
         <value caption="PBCLK is SYSCLK divided by 20" name="DIV_20" value="0x13" />
         <value caption="PBCLK is SYSCLK divided by 19" name="DIV_19" value="0x12" />
         <value caption="PBCLK is SYSCLK divided by 18" name="DIV_18" value="0x11" />
         <value caption="PBCLK is SYSCLK divided by 17" name="DIV_17" value="0x10" />
         <value caption="PBCLK is SYSCLK divided by 16" name="DIV_16" value="0xf" />
         <value caption="PBCLK is SYSCLK divided by 15" name="DIV_15" value="0xe" />
         <value caption="PBCLK is SYSCLK divided by 14" name="DIV_14" value="0xd" />
         <value caption="PBCLK is SYSCLK divided by 13" name="DIV_13" value="0xc" />
         <value caption="PBCLK is SYSCLK divided by 12" name="DIV_12" value="0xb" />
         <value caption="PBCLK is SYSCLK divided by 11" name="DIV_11" value="0xa" />
         <value caption="PBCLK is SYSCLK divided by 10" name="DIV_10" value="0x9" />
         <value caption="PBCLK is SYSCLK divided by 9" name="DIV_9" value="0x8" />
         <value caption="PBCLK is SYSCLK divided by 8" name="DIV_8" value="0x7" />
         <value caption="PBCLK is SYSCLK divided by 7" name="DIV_7" value="0x6" />
         <value caption="PBCLK is SYSCLK divided by 6" name="DIV_6" value="0x5" />
         <value caption="PBCLK is SYSCLK divided by 5" name="DIV_5" value="0x4" />
         <value caption="PBCLK is SYSCLK divided by 4" name="DIV_4" value="0x3" />
         <value caption="PBCLK is SYSCLK divided by 3" name="DIV_3" value="0x2" />
         <value caption="PBCLK is SYSCLK divided by 2" name="DIV_2" value="0x1" />
         <value caption="PBCLK is SYSCLK divided by 1" name="DIV_1" value="0x0" />

      </value-group>
